
count = input("Введите кол-во чисел:\n")

a = 0
b = 0
while(count != 0):
    if(a == 0):
        a = input("Введите первое число:\n")
    c = input("Выберите операцию\n 1. Умножение \n 2. Деление \n 3. Остаток \n 4. Возведение в степень \n 5. Вычитание \n 6. Сложение\n")
    while(len(c) != 1):
        c = input("Выберите операцию\n 1. Умножение \n 2. Деление \n 3. Остаток \n 4. Возведение в степень \n 5. Вычитание \n 6. Сложение\n")
    b = input("Введите число\n")
    while(a == "" or b == ""):
        a = input("Введите первое число\n")
        b = input("Введите число\n")
    a = float(a)
    b = float(b)
    if(c == "1"):
        print("Произведение ",a," и ",b," равно ",a*b)
        a = a*b
    elif c == "2":
        if(a != 0 and b != 0):
            print("Деление ",a," на ",b," равно ",a/b)
            a = a/b
        else:
            print("Деление на ноль запрещено!")
            count = int(count) + 1
    elif c == "3":
        print("Остаток ",a," от ",b," равен ", a%b)
        a = a%b
    elif c == "4":
        print(" в степени ",b," равно ",a**b)
        a = a**b
    elif c == "5":
        print("Вычитание ",a," из ",b," равно ",a-b)
        a = a-b
    elif c == "6":
        print("Сложение ",a," и ",b," равно ",a+b)
        a = a+b
    print("\n")
    
    count = int(count) - 1



